NeatoScan/xml_files/Request_Auction_Report.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://tempuri.org/IAuctionReportDataProvider/Inventory</a:Action>
        <a:MessageID>urn:uuid:a706f7c8-2f28-4758-a78b-23c16fe281b3</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To s:mustUnderstand="1">https://desktopbridge.neatoscan.com/API/api_025/AuctionReportData.svc</a:To>
    </s:Header>
    <s:Body>
        <Inventory xmlns="http://tempuri.org/">
            <token xmlns:b="http://schemas.datacontract.org/2004/07/Neato.WCF.Core"
                xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <b:ClientID />
                <b:ClientUserName></b:ClientUserName>
                <b:DeviceID />
                <b:Expires></b:Expires>
                <b:HasBeenAuthenticated>true</b:HasBeenAuthenticated>
                <b:Info>
                    <b:AppModulesInstalled />
                    <b:AssignedBuildingID>19</b:AssignedBuildingID>
                    <b:DateLastUpdated />
                    <b:Email i:nil="true" />
                    <b:EnabledMarketplaceTypes xmlns:c="http://schemas.datacontract.org/2004/07/NeatoBusiness.Common">
                        <c:MarketplaceTypes>AmazonUS</c:MarketplaceTypes>
                        <c:MarketplaceTypes>eBay</c:MarketplaceTypes>
                        <c:MarketplaceTypes>Alibris</c:MarketplaceTypes>
                        <c:MarketplaceTypes>ShopGoodWill</c:MarketplaceTypes>
                        <c:MarketplaceTypes>eBayAuction</c:MarketplaceTypes>
                        <c:MarketplaceTypes>GoodwillBooks</c:MarketplaceTypes>
                    </b:EnabledMarketplaceTypes>
                    <b:MinimumRequiredVersionAndroid>
                        <b:HasValue>false</b:HasValue>
                        <b:_Value i:nil="true" />
                    </b:MinimumRequiredVersionAndroid>
                    <b:MinimumRequiredVersionWindows>
                        <b:HasValue>false</b:HasValue>
                        <b:_Value i:nil="true" />
                    </b:MinimumRequiredVersionWindows>
                    <b:Password />
                    <b:SessionGuid></b:SessionGuid>
                    <b:UserName />
                    <b:UserPermissions>
                        <b:HasValue>false</b:HasValue>
                        <b:_Value i:nil="true" xmlns:c="http://schemas.datacontract.org/2004/07/NeatoBusiness.Common" />
                    </b:UserPermissions>
                </b:Info>
                <b:Marketplaces>
                    <b:Marketplace z:Id="i1" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>true</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonUS</b:MarketplaceType>
                        <b:OrderDate>2022-09-05T07:54:12</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i2" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>true</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>eBay</b:MarketplaceType>
                        <b:OrderDate>2022-09-04T11:25:45</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i3" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>NeatoscanTestMarketAlpha</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i4" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>NeatoscanTestMarketBeta</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i5" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>NeatoscanTestMarketCharlie</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i6" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>true</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Alibris</b:MarketplaceType>
                        <b:OrderDate>2022-09-05T09:56:46</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i7" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AbeBooks</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i8" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Half</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i9" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonUK</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i10" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonDE</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i11" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonFR</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i12" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonES</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i13" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonIT</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i14" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonCA</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i15" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonJP</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i16" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonCN</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i17" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Quickbooks</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i18" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>BigCommerce</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i19" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Magento</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i20" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Chrislands</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i21" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Valore</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i22" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>AmazonMX</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i23" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>true</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>ShopGoodWill</b:MarketplaceType>
                        <b:OrderDate>2022-09-05T12:57:23</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i24" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>true</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>eBayAuction</b:MarketplaceType>
                        <b:OrderDate>2022-09-05T12:57:29</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i25" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Rakuten</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i26" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>true</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>GoodwillBooks</b:MarketplaceType>
                        <b:OrderDate>2022-09-05T09:56:52</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i27" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>eCampus</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i28" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Biblio</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i29" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Walmart</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                    <b:Marketplace z:Id="i30" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
                        <b:HasChanges>false</b:HasChanges>
                        <b:Enabled>false</b:Enabled>
                        <b:IsSandbox>false</b:IsSandbox>
                        <b:MarketplaceType>Shopify</b:MarketplaceType>
                        <b:OrderDate>2022-08-29T15:04:47.2491244Z</b:OrderDate>
                        <b:UserName></b:UserName>
                    </b:Marketplace>
                </b:Marketplaces>
                <b:NeatoTokenID></b:NeatoTokenID>
                <b:Password xmlns:c="http://schemas.datacontract.org/2004/07/System.Security" />
                <b:UnsecurePassword></b:UnsecurePassword>
                <b:UserName></b:UserName>
            </token>
            <start></start>
            <end></end>
            <type>Auction</type>
        </Inventory>
    </s:Body>
</s:Envelope>